#+STARTUP: fold
#+PROPERTY: header-args:ipython :results both :exports both :async yes :session odr :kernel dual_data

* Notebook Settings

#+begin_src ipython
  %load_ext autoreload
  %autoreload 2
  %reload_ext autoreload

  %run /home/leon/models/lif_cpp/notebooks/setup.py
  %matplotlib inline
  %config InlineBackend.figure_format = 'png'
#+end_src

#+RESULTS:
: The autoreload extension is already loaded. To reload it, use:
:   %reload_ext autoreload
: Python exe
: /home/leon/mambaforge/envs/dual_data/bin/python

* Compilation
#+begin_src sh
  cd $HOME/models/lif_cpp
  make 
#+end_src

#+RESULTS:
| g++ | -Wall | -std=c++17   | -Ofast        | -s                | -march=native | -funroll-loops   | -ftree-vectorize | -ffast-math | -fomit-frame-pointer | -fexpensive-optimizations | -lyaml-cpp    | -c             | src/lif_network.cpp | -o          | obj/lif_network.o    |                           |            |
| g++ | -o    | ./bin/LifNet | obj/globals.o | obj/lif_network.o | obj/main.o    | obj/sparse_mat.o | -Wall            | -std=c++17  | -Ofast               | -s                        | -march=native | -funroll-loops | -ftree-vectorize    | -ffast-math | -fomit-frame-pointer | -fexpensive-optimizations | -lyaml-cpp |

**** Simulation

#+begin_src ipython
  def run_loop_Jee(name, Jee_list, ini_list, phi_list):

      for ini in ini_list:
          for phi in phi_list:
              for Jee in Jee_list:
                  session = "%s_Jee_%.2f_phi_%d_ini_%d" % (name, Jee, phi, ini)
                  data_path = REPO_PATH + '/data/simul/' + session
                  update_conf(REPO_PATH + '/conf/config_EI', 'DATA_PATH', data_path)
                  update_conf(REPO_PATH + '/conf/config_EI', 'Jab', float(Jee), axis=0)
                  update_conf(REPO_PATH + '/conf/config_EI', 'PHI_STIM', float(phi), axis=0)

                  sleep(.2)
                  run_cpp(session)
                  sleep(.2)
                  
                  subprocess.run([REPO_PATH + '/src/mem_usage.sh'])
                  subprocess.run([REPO_PATH + '/src/cpu_usage.sh'])

      restore_conf(REPO_PATH + '/conf/config_EI.yml')
#+end_src

#+RESULTS:

#+begin_src ipython
  name = 'EI'
  run_loop_Jee(name, Jee_list, ini_list, phi_list)
#+end_src

#+RESULTS:
: File moved successfully!

***** Load Data

#+begin_src ipython
  df = load_data(name, Jee_list, ini_list, phi_list, 'Jee')
  print(df.head())
#+end_src

#+RESULTS:
:    trial  phi  Jee  neuron  time  rates
: 0      0    0    0       0     0    4.0
: 1      0    0    0       0     1    4.0
: 2      0    0    0       0     2    4.0
: 3      0    0    0       0     3    8.0
: 4      0    0    0       0     4    0.0

#+begin_src ipython
  df_code, end_point = get_df_code(df, 'Jee')
#+end_src

#+RESULTS:
:        trial  phi  Jee        m0        m1     phase
: 11660      0    0    0  0.263600  0.004021  3.766620
: 11661      0    0    1  0.265333  0.007139  1.962238
: 11662      0    0    2  0.270000  0.009053  2.494349
: 11663      0    0    3  0.286533  0.010270  4.420489
: 11664      0    0    4  0.290133  0.005266  1.065609

